"""
6. Реализовать простую систему хранения данных о суммах продаж булочной.
Должно быть два скрипта с интерфейсом командной строки: для записи данных и для вывода на экран записанных данных.
При записи передавать из командной строки значение суммы продаж.
Для чтения данных реализовать в командной строке следующую логику:
просто запуск скрипта — выводить все записи;
запуск скрипта с одним параметром-числом — выводить все записи с номера, равного этому числу, до конца;
запуск скрипта с двумя числами — выводить записи, начиная с номера, равного первому числу, по номер,
равный второму числу, включительно.
"""

"""
_______________________________________________________________
ФАЙЛЫ НАХОДЯТСЯ В ДИРЕКТОРИИ task_6/

python add.py - скрипт для записи данных
python show.py - скрипт для вывода данных
python show.py 10 - вывод всех данных с номера 10 и до конца
python show.py 10 12 - вывод всех данных с номера 10 до номера 20
_______________________________________________________________
"""
