"""
7. * (вместо 6) Добавить возможность редактирования данных при помощи отдельного скрипта:
передаём ему номер записи и новое значение. При этом файл не должен читаться целиком — обязательное требование.
Предусмотреть ситуацию, когда пользователь вводит номер записи, которой не существует.
"""

"""
_______________________________________________________________
ФАЙЛЫ НАХОДЯТСЯ В ДИРЕКТОРИИ task_8/

python add.py - скрипт для записи данных
python show.py - скрипт для вывода данных
python show.py 10 - вывод всех данных с номера 10 и до конца
python show.py 10 12 - вывод всех данных с номера 10 до номера 20
python edit.py 1 100.01 - изменить данные
_______________________________________________________________
"""