"""
3. Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и возвращающую словарь,
в котором ключи — первые буквы имён, а значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
Например:
thesaurus("Иван", "Мария", "Петр", "Илья")
{
    "И": ["Иван", "Илья"],
    "М": ["Мария"], "П": ["Петр"]
}
Подумайте: полезен ли будет вам оператор распаковки?
Как поступить, если потребуется сортировка по ключам? Можно ли использовать словарь в этом случае?
"""


def thesaurus(*args):
    """Возвращает словать из имен сотрудников"""

    name_dict = dict()

    for name in args:

        if not name_dict.get(name[0]):  # инициализируем элемент словаря, если его еще нет
            name_dict[name[0]] = list()

        name_dict[name[0]].append(name)

    return name_dict


print(thesaurus("Иван", "Мария", "Петр", "Илья"))
